# CannotCopyCuttingInsert Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyMonitorFailures..::..CannotCopyCuttingInsert Property
BuiltInFailures..::..CopyMonitorFailures Class See Also
---
Copy/Monitor does not support cutting inserts in floors. Some openings were not copied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyCuttingInsert { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyCuttingInsert As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyCuttingInsert {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyMonitorFailures Class
Autodesk.Revit.DB Namespace